#include <iostream>
#include <windows.h>
#include "Modules_Sokolov.h"

using namespace std;

int main() {
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    cout << "========================================\n";
    cout << " ЗАПУСК ТЕСТОВОГО ДРАЙВЕРА\n";
    cout << "========================================\n\n";
    cout << "Виконується завдання 10.1...\n";
    task10_1("in_10_1.txt", "out_10_1.txt");
    cout << "Результат записано у файл: out_10_1.txt\n\n";

    cout << "Виконується завдання 10.2...\n";
    task10_2("in_10_2.txt");
    cout << "Абетку та час дописано у файл: in_10_2.txt\n\n";

    cout << "Виконується завдання 10.3...\n";

    task10_3("out_10_3.txt", 1.5, 2.0, 3.5, 10);

    task10_3("out_10_3.txt", 0.0, 0.0, 0.0, 0);

    task10_3("out_10_3.txt", -5.5, 10.2, -1.1, 255);

    cout << "Результати обчислень дописано у файл: out_10_3.txt\n\n";

    cout << "Тестування завершено. Відкрийте текстові файли і перевірте результат!\n";
    return 0;
}
